IDEA StatiCa Open Model
HingeElement1D.HingeTypeX Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Hinge type in dirrection X
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public HingeTypeInDirrection HingeTypeX { get; set; }
Public Property HingeTypeX As HingeTypeInDirrection
	Get
	Set
public:
property HingeTypeInDirrection HingeTypeX {
	HingeTypeInDirrection get ();
	void set (HingeTypeInDirrection value);
}
Property Value
Type: HingeTypeInDirrection
See Also
Reference
HingeElement1D Class
IdeaRS.OpenModel.Model Namespace